In [7]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.0-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.0-cp310-cp310-win_amd64.whl (11.6 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
import pandas as pd

In [12]:
data = {'Name': ['Alis', 'Bat Sheva', 'Galia'],
       'Grade': [1,2,7],
        'Marks Average': [90, 45, 70]}

In [15]:
df= pd.DataFrame(data)
df

        Name  Grade  Marks Average
0       Alis      1             90
1  Bat Sheva      2             45
2      Galia      7             70

In [16]:
df.loc[len(df.index)] = ['Amy', 6, 93]

In [17]:
df

        Name  Grade  Marks Average
0       Alis      1             90
1  Bat Sheva      2             45
2      Galia      7             70
3        Amy      6             93

In [18]:
df['Name']

0         Alis
1    Bat Sheva
2        Galia
3          Amy
Name: Name, dtype: object

In [19]:
df.loc[len(df.index)] = ['Noa', 11, 93]

In [20]:
df.loc[len(df.index)] = ['Sara', 11, 69]

In [21]:
df[df['Grade']==11]

   Name  Grade  Marks Average
4   Noa     11             93
5  Sara     11             69

In [22]:
df['Marks Average'].max()

93

In [39]:
newdf = pd.read_csv(r'Z:/B/וייל מרים/python/cities.csv')
newdf

,LatD,LatM,LatS,NS,LonD,LonM,LonS,EW,City,State
0,41,5,59,"""N""",80,39.0,0.0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23.0,23.0,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30.0,NaN,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48.0,0.0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46.0,11.0,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48.0,35.0,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39.0,0.0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14.0,23.0,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55.0,48.0,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14.0,23.0,"""W""","""Ravenna""",OH

In [40]:
newdf.isnull().sum()

LatD      0
 LatM     0
 LatS     0
 NS       1
 LonD     0
 LonM     1
 LonS     2
 EW       0
 City     1
 State    1
dtype: int64

In [52]:
newdf.columns = newdf.columns.str.strip()

In [53]:
newdf.NS = newdf.NS.fillna("N")
med1 = newdf.LonD.median()
newdf.LonD = newdf.LonD.fillna(med1)
med2 = newdf.LonM.median()
newdf.LonM = newdf.LonM.fillna(med2)
med3 = newdf.LonS.median()
newdf.LonS = newdf.LonS.fillna(med3)
newdf.City = newdf.City.fillna("no city selected")
newdf.City = newdf.City.fillna("no state selected")
newdf

     LatD  LatM  LatS    NS  LonD  LonM  LonS    EW                City State
0      41     5    59   "N"    80  39.0   0.0   "W"        "Youngstown"    OH
1      42    52    48   "N"    97  23.0  23.0   "W"           "Yankton"    SD
2      46    35    59   "N"   120  30.0  23.0   "W"            "Yakima"    WA
3      42    16    12   "N"    71  48.0   0.0   "W"         "Worcester"    MA
4      43    37    48   "N"    89  46.0  11.0   "W"   "Wisconsin Dells"    WI
..    ...   ...   ...   ...   ...   ...   ...   ...                 ...   ...
123    39    31    12   "N"   119  48.0  35.0   "W"              "Reno"    NV
124    50    25    11   "N"   104  39.0   0.0   "W"            "Regina"    SA
125    40    10    48   "N"   122  14.0  23.0   "W"         "Red Bluff"    CA
126    40    19    48   "N"    75  55.0  48.0   "W"           "Reading"    PA
127    41     9    35   "N"    81  14.0  23.0   "W"           "Ravenna"   OH

[128 rows x 10 columns]

In [54]:
newdf['LonM'].mean()

27.9296875

In [55]:
newdf['LonM'].min()

0.0

In [56]:
newdf['LonM'].max()

58.0

In [72]:
newdf.insert(3, 'yachas2', newdf.LatM/newdf.LatS)

In [86]:
newdf.loc[newdf.State=='OH'].sort_values()

Empty DataFrame
Columns: [LatD, LatM, LatS, yachas2, yachas, NS, LonD, LonM, LonS, EW, City, State]
Index: []